import { Link } from 'react-router-dom';

// แก้โค๊ดบรรทัดที่ 13 ชั่วโมงที่ 2:12:52 เปลี่ยนเป็นแท็ก Link เติม to

// แก้บรรทัดที่ 15,16,17 ชั่วโมงที่ 2:13:19 เปลี่ยนเป็นแท็ก a เติม href

// เพิ่มคำบรรทัดที่ 6 ชั่วโมงที่ 2:17:51 (setShowLogin)
// เพิ่มคำบรรทัดที่ 8 ชั่งโมงที่ 3:08:21 

// เพิ่มคำบรรทัดที่ 25 ชั่วโมงที่ 2:18:05 เพิ่ม onClick

// เพิ่มบรรทัดที่ 22 เพิ่มแท็ก Link ไปหน้า cart

// เพิ่มบรรทัดที่ 12 เพิ่มแท็ก Link 

// แก้ไขบรรทัดที่ 26 ตรงชื่อคลาสจาก dot เป็น getTotalCartAmount()===0?"":"dot" ชั่วโมงที่ 3:08:50

